RRPairs_current/getTransactions-req.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><getTransactions xmlns="http://ejb3.examples.itko.com/"><accountId xmlns="">2088767566</accountId><from xsi:type="xsd:dateTime" xmlns="">2013-07-02T13:05:49.789Z</from><to xsi:type="xsd:dateTime" xmlns="">2013-07-09T13:05:49.789Z</to></getTransactions></soapenv:Body></soapenv:Envelope>