SolFwk-LCTAG-Repository/API/LisaBank-GetAccount_1.0.0/GetAccount1-req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <soapenv:Body>
    <getAccount xmlns="http://ejb3.examples.itko.com/">
      <accountId xmlns="">1433785279732958</accountId>
    </getAccount>
  </soapenv:Body>
</soapenv:Envelope>