RRPairs_current/getAccount-req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <getAccount xmlns="http://ejb3.examples.itko.com/">
            <accountId xmlns="">269571816734</accountId>
        </getAccount>
    </soapenv:Body>
</soapenv:Envelope>