lisabank-demo/src/test/resources/AccountServiceTest/createUserWithCheckingAccount/Test/itkoExamples/EJB3AccountControlBean/recording-6-req.xml

POST /itkoExamples/EJB3AccountControlBean HTTP/1.1
 Content-Type: text/xml; charset=UTF-8
SOAPAction: ""
Token: -121238a4:1596fc5557e:-7fea
User-Agent: Apache CXF 3.1.6
Pragma: no-cache
Content-Length: 281

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:addAccount xmlns:ns2="http://ejb3.examples.itko.com/"><username>pascal</username><accountObj><balance>1000</balance><type>CHECKING</type></accountObj></ns2:addAccount></soap:Body></soap:Envelope>